InformationRegisters/МестаОсуществленияДеятельностиИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>МестаОсуществленияДеятельностиИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДанныеАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторВетИС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеПодконтрольныхОбъектовВетИС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентГосИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторМОД</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТоварнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппыГИСМТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодФИАС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МестаОсуществленияДеятельностиИСМП/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	ОрганизацияОтбор = Неопределено;
	Если Параметры.Свойство("Организация", ОрганизацияОтбор) Тогда
		ВладелецСписок.Добавить(ОрганизацияОтбор);
		ПриИзмененииОтбора(ЭтотОбъект, "ВладелецСписок");
	КонецЕсли;
	
	ТоварнаяГруппаОтбор = Неопределено;
	Если Параметры.Свойство("ТоварнаяГруппа", ТоварнаяГруппаОтбор) Тогда
		ТоварнаяГруппаСписок.Добавить(ТоварнаяГруппаОтбор);
		ПриИзмененииОтбора(ЭтотОбъект, "ТоварнаяГруппаСписок");	
	КонецЕсли;
	
	Если Параметры.Свойство("КПП", КПП) Тогда
		Если ЗначениеЗаполнено(КПП) Тогда
			ПриИзмененииОтбораПоКПП(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
	НастроитьЭлементыФормыПриСоздании();
	НастроитьЭлементыФормы(ЭтотОбъект);
		
	СобытияФормИС.ПоляСоставногоТипаИнициализация(ЭтотОбъект, ИменаЭлементовПолейСоставногоТипа());
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТоварныеГруппыОтборПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ПолеОтбораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура ТоварнаяГруппаОтборПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	ПриИзмененииОтбора(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТоварнаяГруппаОтборПредставлениеПриИзменении(Элемент)
	ПриИзмененииОтбора(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТоварнаяГруппаОтборСтрокойОчистка(Элемент, СтандартнаяОбработка)
	
	ТоварнаяГруппаСписок.Очистить();
	ПриИзмененииОтбора(ЭтотОбъект, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецОтборПредставлениеПриИзменении(Элемент)
	ПолеСоставногоТипаПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ВладелецОтборПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ПолеОтбораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВладелецОтборПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	ПолеСоставногоТипаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВладелецОтборСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПолеСоставногоТипаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АктуализироватьСписок(Команда)
	
	ОчиститьСообщения();
	
	ПараметрыАктуализацииМОД = Новый Структура();
	ПараметрыАктуализацииМОД.Вставить("ИННУчастника",    СписокИННПоВыбраннымВладельцамМОД());
	ПараметрыАктуализацииМОД.Вставить("ТоварныеГруппы",  ТоварнаяГруппаСписок.ВыгрузитьЗначения());
	ПараметрыАктуализацииМОД.Вставить("ПолныйСписокМОД", Истина);
	
	ПараметрыАктуализацииМОД.Вставить("ТоварнаяГруппа", ПустаяСсылкаТоварнаяГруппа());
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТоварныеГруппы", ПараметрыАктуализацииМОД.ТоварныеГруппы);
	
	ПослеВыполненияОбновления = Новый ОписаниеОповещения("ПослеАктуализацииСпискаМОД", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыЗапроса                         = ИнтерфейсИСМПОбщегоНазначенияКлиент.ПараметрыЗапросаДанных();
	ПараметрыЗапроса.ОповещениеОЗавершении   = ПослеВыполненияОбновления;
	ПараметрыЗапроса.УникальныйИдентификатор = УникальныйИдентификатор;
	ПараметрыЗапроса.Параметры               = ПараметрыАктуализацииМОД;
	
	ИнтерфейсИСМПОбщегоНазначенияКлиент.АктуализацияСпискаМестОсуществленияДеятельности(ПараметрыЗапроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьМОД(Команда)
	
	ПараметрыРегистрацииМОД = ИнтеграцияИСМПКлиент.ПараметрыРегистрацииМОДГИСМТ();
	СписокМОДКРегистрации   = Новый Массив;
	ВыбранныеТоварныеГруппы = Новый Массив;

	Для Каждого ТоварнаяГруппаОтбор Из ТоварнаяГруппаСписок Цикл
		ВыбранныеТоварныеГруппы.Добавить(ТоварнаяГруппаОтбор.Значение);
	КонецЦикла;
	
	ПараметрыРегистрацииМОД.ТоварныеГруппы = ВыбранныеТоварныеГруппы;
	
	Если ВладелецСписок.Количество() = 1 Тогда
		ОрганизацияОтбор = ВладелецСписок[0].Значение;
		Если ТипЗнч(ОрганизацияОтбор) = Тип("СправочникСсылка.Организации") Тогда
			ПараметрыРегистрацииМОД.Организация = ВладелецСписок[0].Значение;
		КонецЕсли;
	КонецЕсли;
	
	СписокМОДКРегистрации.Добавить(ПараметрыРегистрацииМОД);
	
	ПараметрыОткрытияФормыРегистрации = ИнтеграцияИСМПКлиент.ПараметрыОткрытияФормыРегистрацииМОДГИСМТ();
	
	ПараметрыОткрытияФормыРегистрации.СписокМОДКРегистрации     = СписокМОДКРегистрации;
	ПараметрыОткрытияФормыРегистрации.НезависимаяРегистрацияМОД = Ложь;
	
	ПослеРегистрацииМОД = Новый ОписаниеОповещения("ПослеРегистрацииМОДВГИСМТ", ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.МестаОсуществленияДеятельностиИСМП.Форма.ФормаРегистрацииМОДВСервисе",
		ПараметрыОткрытияФормыРегистрации, ЭтотОбъект, , , , ПослеРегистрацииМОД, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМОД(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеВыбранногоМОД = Новый Структура;
	ДанныеВыбранногоМОД.Вставить("ДанныеАдреса",        ТекущаяСтрока.ДанныеАдреса);
	ДанныеВыбранногоМОД.Вставить("ПредставлениеАдреса", ТекущаяСтрока.ПредставлениеАдреса);
	ДанныеВыбранногоМОД.Вставить("КодФИАС",             ТекущаяСтрока.КодФИАС);
	ДанныеВыбранногоМОД.Вставить("ИдентификаторМОД",    ТекущаяСтрока.ИдентификаторМОД);
	
	Закрыть(ДанныеВыбранногоМОД);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьМОД(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Владелец) <> Тип("СправочникСсылка.Организации") Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Операция недоступна для МОД контрагентов.'"));
		Возврат;
	КонецЕсли;
	
	Если Не ВыводИзОборотаКлиентСервер.ДоступнаРегистрацияМОДВГИСМТ(ТекущиеДанные.ТоварнаяГруппа) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтрШаблон(
				НСтр("ru = 'Для товарной группы %1 удаление МОД в ГИС МТ недоступно.'"),
				ТекущиеДанные.ТоварнаяГруппа));
		Возврат;
	КонецЕсли;
	
	ПараметрыУдаленияМОД = Новый Структура;
	ПараметрыУдаленияМОД.Вставить("ТоварнаяГруппа", ТекущиеДанные.ТоварнаяГруппа);
	ПараметрыУдаленияМОД.Вставить("КодФИАС",        ТекущиеДанные.КодФИАС);
	ПараметрыУдаленияМОД.Вставить("КПП",            ТекущиеДанные.КПП);
	ПараметрыУдаленияМОД.Вставить("ИНН",            ТекущиеДанные.ИНН);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыЗапроса", ПараметрыУдаленияМОД);
	ДополнительныеПараметры.Вставить("Организация",      ТекущиеДанные.Владелец);
	
	ТекстВопроса = СтрШаблон(НСтр("ru = 'Место осуществления деятельности с кодом ФИАС ""%1"" будет удалено в ГИС МТ'"),
		ТекущиеДанные.КодФИАС);
	
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("УдалениеМОДВопросЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Кнопки = Новый СписокЗначений();
	Кнопки.Добавить("Продолжить");
	Кнопки.Добавить("Отмена");
	
	ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, Кнопки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	//Адрес
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПредставлениеАдреса.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ПредставлениеАдреса");
	ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст",      НСтр("ru='<не заполнено>'"));
	
	//Дата обновления
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДатаПоследнегоОбновления.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ДатаПоследнегоОбновления");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = ТекущаяДатаСеанса() - (86400 * 45);
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаТребуетВниманияГосИС);
	
	//Владелец
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Владелец.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Владелец");
	ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст",      НСтр("ru='<не подобран по ИНН и КПП>'"));
	
	//Идентификатор МОД
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИдентификаторМОД.Имя);
	
	ТоварныаГруппыСырье = Справочники.ТоварныеГруппыГИСМТ.ПустаяСсылка();
	ВидыПродукцииСырье = КонструкторИСМПКлиентСервер.ВидыПродукцииСырьеГИСМТ();
	Для Каждого ВидПродукции Из ВидыПродукцииСырье Цикл
		ТоварныаГруппыСырье = КонструкторИСМПОбщегоНазначенияКлиентСервер.ТоварнаяГруппаПоВидуПродукции(ВидПродукции);
		Прервать;
	КонецЦикла;
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ТоварнаяГруппа");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = ТоварныаГруппыСырье;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст",      НСтр("ru='<не требуется>'"));
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормыПриСоздании();
	
	РежимВыборМОД = Ложь;
	Если Не Параметры.Свойство("ВыборМОД", РежимВыборМОД) Тогда
		РежимВыборМОД = Ложь;
	КонецЕсли;
	
	Элементы.СписокВыбратьМОД.Видимость        = РежимВыборМОД;
	Элементы.ВладелецСтрокой.Доступность       = Не РежимВыборМОД;
	Элементы.ТоварнаяГруппаСтрокой.Доступность = Не РежимВыборМОД;
	Элементы.КодФИАС.Видимость                 = РежимВыборМОД;
	Элементы.Владелец.Видимость                = Не РежимВыборМОД;
	Элементы.ТоварнаяГруппа.Видимость          = Не РежимВыборМОД;
	
	ЭтоСырьеГИСМТ = Ложь;
	
	Если ТоварнаяГруппаСписок.Количество() Тогда
		СписокТоварныхГрупп = ТоварнаяГруппаСписок.ВыгрузитьЗначения();
		
		Для каждого ТоварнаяГруппа Из СписокТоварныхГрупп Цикл
			ЭтоСырьеГИСМТ = КонструкторИСМПКлиентСервер.ЭтоСырьеГИСМТ(ТоварнаяГруппа);
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.КПП.Видимость                                = Не ЭтоСырьеГИСМТ;
	Элементы.НаличиеПодконтрольныхОбъектовВетИС.Видимость = Не ЭтоСырьеГИСМТ;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьЭлементыФормы(Форма);
	
	Элементы = Форма.Элементы;
	
	Если ЗначениеЗаполнено(Форма.ТоварнаяГруппа) Тогда
		ДоступноСозданиеМОД = ВыводИзОборотаКлиентСервер.ДоступнаРегистрацияМОДВГИСМТ(Форма.ТоварнаяГруппа);
	ИначеЕсли Форма.ТоварнаяГруппаСписок.Количество() Тогда
		ДоступноСозданиеМОД = ВыводИзОборотаКлиентСервер.ДоступнаРегистрацияМОДВГИСМТ(Форма.ТоварнаяГруппаСписок.ВыгрузитьЗначения());
	Иначе
		ДоступноСозданиеМОД = ВыводИзОборотаКлиентСервер.ДоступнаРегистрацияМОДВГИСМТ(
			ОбщегоНазначенияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции());
	КонецЕсли;
	
	Элементы.ФормаЗарегистрироватьМОД.Видимость = ДоступноСозданиеМОД;
	Элементы.СписокУдалитьМОД.Видимость = ДоступноСозданиеМОД;
	Элементы.ИдентификаторМОД.Видимость = КонструкторИСМПКлиентСервер.ВидыПродукцииСырьеГИСМТ().Количество() > 0;
	
КонецПроцедуры

#Область СписокМОДОтборы

&НаКлиенте
Процедура ПолеОтбораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяЭлементаОтбора       = Лев(Элемент.Имя, СтрДлина(Элемент.Имя) - 7);
	ИмяЭлементаОтбораСписок = СтрШаблон("%1Список", ИмяЭлементаОтбора);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВыбранныеЗначения", ЭтотОбъект[ИмяЭлементаОтбораСписок].ВыгрузитьЗначения());
	ПараметрыОткрытия.Вставить("ИмяЭлементаОтбора", ИмяЭлементаОтбора);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаОтбора", ИмяЭлементаОтбора);
	
	ПослеВыбораЗначенийОтбора = Новый ОписаниеОповещения("ПолеОтбораОкончаниеВыбора", ЭтотОбъект,
		ДополнительныеПараметры);
	
	ОткрытьФорму("РегистрСведений.МестаОсуществленияДеятельностиИСМП.Форма.ФормаВыбораЗначенийОтбора",
		ПараметрыОткрытия, ЭтотОбъект,,,, ПослеВыбораЗначенийОтбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтбораОкончаниеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяЭлементаОтбораСписок = СтрШаблон("%1Список", ДополнительныеПараметры.ИмяЭлементаОтбора);
	ЭтотОбъект[ИмяЭлементаОтбораСписок].ЗагрузитьЗначения(Результат);
	ПриИзмененииОтбора(ЭтотОбъект, ИмяЭлементаОтбораСписок);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПриИзмененииОтбора(Форма, Имя)
	
	Если Прав(Имя, 6) = "Список" Тогда
		ИмяЭлементаОтбора        = Лев(Имя, СтрДлина(Имя) - 6);
		ИмяЭлементаОтбораСписок  = Имя;
		ИмяЭлементаОтбораСтрокой = СтрШаблон("%1Строкой", ИмяЭлементаОтбора);
		
		Форма[ИмяЭлементаОтбораСтрокой] = Строка(Форма[ИмяЭлементаОтбораСписок]);
		
	ИначеЕсли Прав(Имя, 7) = "Строкой" Тогда
		ИмяЭлементаОтбора        = Лев(Имя, СтрДлина(Имя) - 7);;
		ИмяЭлементаОтбораСписок  = СтрШаблон("%1Список", ИмяЭлементаОтбора);
		ИмяЭлементаОтбораСтрокой = Имя;
		
		Форма[ИмяЭлементаОтбораСписок].Очистить();
		Если ЗначениеЗаполнено(Форма[ИмяЭлементаОтбораСтрокой]) Тогда
			Форма[ИмяЭлементаОтбораСписок].Добавить(Форма[ИмяЭлементаОтбора]);
		КонецЕсли;
		
	КонецЕсли;
	
	Форма.Элементы[ИмяЭлементаОтбораСтрокой].РедактированиеТекста = Форма[ИмяЭлементаОтбораСписок].Количество() < 2;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.Список, ИмяЭлементаОтбора, Форма[ИмяЭлементаОтбораСписок],
		ВидСравненияКомпоновкиДанных.ВСписке,,
		Форма[ИмяЭлементаОтбораСписок].Количество() > 0);
	
	НастроитьЭлементыФормы(Форма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеСоставногоТипаПриИзменении(Элемент)
	
	СобытияФормИСКлиент.ПолеСоставногоТипаПриИзменении(ЭтотОбъект, Элемент);
	
	ПриИзмененииОтбора(ЭтотОбъект, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеСоставногоТипаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СобытияФормИСКлиент.ПолеСоставногоТипаОбработкаВыбора(ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	
	ПриИзмененииОтбора(ЭтотОбъект, Элемент.Имя);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИменаЭлементовПолейСоставногоТипа()
	
	Возврат "ВладелецСтрокой";
	
КонецФункции

&НаКлиенте
Процедура ПолеСоставногоТипаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ЭтотОбъект[СтрЗаменить(Элемент.Имя, "Строкой", "Список")].Количество() > 1 Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	СобытияФормИСКлиент.ПолеСоставногоТипаАвтоПодбор(ЭтотОбъект,
		Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеСоставногоТипаОкончаниеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	СобытияФормИСКлиент.ПолеСоставногоТипаОкончаниеВыбора(ЭтотОбъект, Результат, ДополнительныеПараметры);
	
	ПриИзмененииОтбора(ЭтотОбъект, ДополнительныеПараметры.Элемент.Имя);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПриИзмененииОтбораПоКПП(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.Список, "КПП", Форма.КПП, 
		ВидСравненияКомпоновкиДанных.Равно, Истина);
		
КонецПроцедуры

#КонецОбласти

#Область АктуализацияСпискаМОД

&НаКлиенте
Процедура ПослеАктуализацииСпискаМОД(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ЕстьОшибки Тогда
		Если ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ТекстОшибки);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ОбновитьСписокМОДПоДаннымИзСервиса(Результат.Результат, ДополнительныеПараметры);
	ПослеУспешногоОбновленияСпискаМОД();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеУспешногоОбновленияСпискаМОД()
	Элементы.Список.Обновить();	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокМОДПоДаннымИзСервиса(СписокМОДИзСервиса, ПараметрыАктуализации)
	
	ДополнительныеПараметры = РегистрыСведений.МестаОсуществленияДеятельностиИСМП.ИнициализироватьПараметрыЗаписиМОД();
	ДополнительныеПараметры.Обновление = Истина;
	
	Если ВладелецСписок.Количество() Тогда
		ДополнительныеПараметры.СОтборомПоИНН = Истина;
		Если ВладелецСписок.Количество() = 1 Тогда
			ДополнительныеПараметры.Владелец = ВладелецСписок[0].Значение;
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеПараметры.ТоварныеГруппы = ПараметрыАктуализации.ТоварныеГруппы;
	
	РегистрыСведений.МестаОсуществленияДеятельностиИСМП.ОбновитьСписокМестОсуществленияДеятельности(СписокМОДИзСервиса,
		ДополнительныеПараметры);
			
КонецПроцедуры

&НаСервере
Функция СписокИННПоВыбраннымВладельцамМОД()
	
	ВладельцыСоответствие = Новый Соответствие();
	
	СтруктураИННКПП = Новый Структура();
	СтруктураИННКПП.Вставить("ИНН", "");
	СтруктураИННКПП.Вставить("КПП", "" );
	
	СписокИНН = Новый Массив;
	
	Для каждого СтрокаВладельца Из ВладелецСписок Цикл
		ВладельцыСоответствие.Вставить(СтрокаВладельца, СтруктураИННКПП);	
	КонецЦикла;
		
	ОбщегоНазначенияИСПереопределяемый.ЗаполнитьИННКПППоНесколькимОрганизациямКонтрагентам(ВладельцыСоответствие,
		ВладелецСписок.ВыгрузитьЗначения());
	
	Для каждого КлючИЗначение Из ВладельцыСоответствие Цикл
		ИННВЗапрос = КлючИЗначение.Значение.ИНН;
		Если ЗначениеЗаполнено(ИННВЗапрос) Тогда
			СписокИНН.Добавить(ИННВЗапрос);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокИНН;
	
КонецФункции

&НаСервере
Функция ПустаяСсылкаТоварнаяГруппа()
	
	Возврат Справочники.ТоварныеГруппыГИСМТ.ПустаяСсылка();	
	
КонецФункции

#КонецОбласти

#Область РегистрацияУдалениеМОДГИСМТ

&НаКлиенте
Процедура ПослеРегистрацииМОДВГИСМТ(Результат, ДополнительныеПараметры) Экспорт
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура УдалениеМОДВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = "Продолжить" Тогда
		ПослеВыполненияУдаления = Новый ОписаниеОповещения("ПослеУдаленияМОДВГИСМТ",
			ЭтотОбъект, ДополнительныеПараметры.ПараметрыЗапроса);

		ПараметрыЗапроса                         = ИнтерфейсИСМПОбщегоНазначенияКлиент.ПараметрыЗапросаДанных();
		ПараметрыЗапроса.Организация             = ДополнительныеПараметры.Организация;
		ПараметрыЗапроса.ОповещениеОЗавершении   = ПослеВыполненияУдаления;
		ПараметрыЗапроса.УникальныйИдентификатор = УникальныйИдентификатор;
		ПараметрыЗапроса.Параметры               = ДополнительныеПараметры.ПараметрыЗапроса;

		ИнтерфейсИСМПОбщегоНазначенияКлиент.УдалениеМестОсуществленияДеятельностиГИСМТ(ПараметрыЗапроса);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеУдаленияМОДВГИСМТ(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ЕстьОшибки Тогда
		Если ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ТекстОшибки);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	УдалениеМОДГИСМТЗавершение(ДополнительныеПараметры);
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УдалениеМОДГИСМТЗавершение(ПараметрыМОД)
	
	ДополнительныеПараметры = РегистрыСведений.МестаОсуществленияДеятельностиИСМП.ИнициализироватьПараметрыЗаписиМОД();
	ДополнительныеПараметры.Удаление = Истина;
	
	РегистрыСведений.МестаОсуществленияДеятельностиИСМП.ОбновитьСписокМестОсуществленияДеятельности(ПараметрыМОД, 
		ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
